target/jaxws/wsgen/wsdl/HelloWsService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.7-b01-. -->
<definitions targetNamespace="http://ws.jaxwsExample/" name="HelloWsService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://ws.jaxwsExample/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types/>
  <message name="sayHello">
    <part name="arg0" type="xsd:string"/>
  </message>
  <message name="sayHelloResponse">
    <part name="return" type="xsd:string"/>
  </message>
  <portType name="HelloWs">
    <operation name="sayHello">
      <input message="tns:sayHello"/>
      <output message="tns:sayHelloResponse"/>
    </operation>
  </portType>
  <binding name="HelloWsPortBinding" type="tns:HelloWs">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
    <operation name="sayHello">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal" namespace="http://ws.jaxwsExample/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://ws.jaxwsExample/"/>
      </output>
    </operation>
  </binding>
  <service name="HelloWsService">
    <port name="HelloWsPort" binding="tns:HelloWsPortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

